app/controllers/course_schedules_controller.rb

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `course_schedules` WHERE (`course_schedules`.course_id = 1) LIMIT 0, 10
SELECT count(*) AS count_all FROM `course_schedules` WHERE (`course_schedules`.course_id = 2)
---
  def index
    @course = Course.find(params[:course_id])
    @course_schedules = @course.course_schedules.paginate :page => params[:page], :per_page => 10

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Teacher') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 5 )
---
  def new
    @course = Course.find(params[:id])
    @course_schedule = CourseSchedule.new(params[:courseschedule])
    @teacherusers = Role.find_by_role_name("Teacher").users
    @teachers = []
    @teacherusers.each do |tu|

SELECT * FROM `course_schedules` WHERE (`course_schedules`.`id` = 58)
SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Teacher') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 5 )
---
  def edit
    @course_schedule = CourseSchedule.find(params[:id])
    @course = @course_schedule.course

    @teacher_sel = @course_schedule.teacher
    @assistant_sel = @course_schedule.assistant
    @assistant2_sel = @course_schedule.assistant2

    @teacherusers = Role.find_by_role_name("Teacher").users
    @teachers = []
    @teacherusers.each do |tu|

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
SELECT * FROM `course_schedules` WHERE (date_format(start_date,'%Y-%m-%d') = '2010-02-27' and course_id=2 and teacher_id='4')
INSERT INTO `course_schedules` (`start_date`, `end_date`, `address1`, `city`, `address2`, `updated_at`, `displayname`, `country`, `volunteer_id`, `teacher_id`, `volunteer_id2`, `deleted`, `last_updated_by`, `course_id`, `center_id`, `location_name`, `state`, `created_at`) VALUES('2010-04-22 07:00:00', '2010-04-17 07:00:00', NULL, NULL, NULL, '2010-04-06 02:58:30', NULL, NULL, 2, 3, NULL, NULL, 2, 2, NULL, NULL, NULL, '2010-04-06 02:58:30')
---
  def create
    @course = Course.find(params[:course_id])
    #@course_schedule = @course.course_schedules.build(params[:course_schedule])
    @course_schedule = CourseSchedule.new
    @course_schedule.course_id = params[:course_id]
    @course_schedule.start_date = Time.parse(params[:start_date])
    if !params[:end_date].empty?
      @course_schedule.end_date = Time.parse(params[:end_date])
    end
    @teach = params[:teachers][:id]
    @assis = params[:assistants][:id]
    @assis2 = params[:assistants2][:id]
    @course_schedule.teacher_id = @teach
    @course_schedule.volunteer_id = @assis
    @course_schedule.volunteer_id2 = @assis2

    @course_schedule.center_id = session[:center_id]
    @course_schedule.last_updated_by = current_user[:id]
      @cs = CourseSchedule.find(:all, :conditions => ["start_date = ? and course_id=? and teacher_id=?", Time.parse(params[:start_date]).to_time.utc, @course.id, @teach])
      if !@cs.empty?
        flash[:notice] = 'Could not create course schedule. A course schedule with the same start date, teacher for this course already exists.'
        redirect_to(course_course_schedules_path(@course.id))
      elsif @course_schedule.save

SELECT * FROM `course_schedules` WHERE (start_date = '2010-04-08 07:00:00' and course_id=2 and teacher_id='3') LIMIT 1
SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
UPDATE `course_schedules` SET `teacher_id` = 103, `end_date` = '2010-03-18 07:00:00', `start_date` = '2010-03-09 08:00:00', `volunteer_id2` = 73, `volunteer_id` = 2, `updated_at` = '2010-04-06 05:29:24' WHERE `id` = 62
---
  def update
    @course_schedule = CourseSchedule.find(params[:id])
    @course_schedule.last_updated_by = current_user[:id]

    @course_schedule.start_date = Time.parse(params[:start_date])
    if !params[:end_date].empty?
      @course_schedule.end_date = Time.parse(params[:end_date])
    end
    @teach = params[:teacher_sel][:id]
    @assis = params[:assistant_sel][:id]
    @assis2 = params[:assistant2_sel][:id]
    @course_schedule.teacher_id = @teach
    @course_schedule.volunteer_id = @assis
    @course_schedule.volunteer_id2 = @assis2

    @course = @course_schedule.course
      @cs = CourseSchedule.find(:first, :conditions => ["start_date = ? and course_id=? and teacher_id=?", Time.parse(params[:start_date]).to_time.utc, @course.id, @teach])
      puts "hello ->>>"
      if !@cs.nil? and @cs.id != @course_schedule.id
        flash[:notice] = 'Could not create course schedule. A course schedule with the same start date, teacher for this course already exists.'
        redirect_to(course_course_schedules_path(@course.id))
      elsif @course_schedule.save