app/controllers/courses_controller.rb

SELECT * FROM `courses` LIMIT 0, 10
---
  def index
    @courses = Course.paginate :page => params[:page], :per_page => 5

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
---
  def show
    @course = Course.find(params[:id])

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`name`, `created_at`, `displayName`, `updated_at`, `deleted`) VALUES('part1', '2011-04-10 00:16:38', 'part-1', '2011-04-10 00:16:38', NULL)
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
UPDATE `courses` SET `updated_at` = '2011-04-23 03:07:04', `name` = 'AG-1' WHERE `id` = 2
---
  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])