app/controllers/member_report_controller.rb

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `course_schedules` LIMIT 0, 10
SELECT count(*) AS count_all FROM `course_schedules`
SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Teacher') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 5 )
---
  def index
    @courses = Course.find(:all)
    @courseschedules = CourseSchedule.paginate :page => params[:page], :per_page => 10
    @cs_id = -1
    @teacherusers = Role.find_by_role_name("Teacher").users
    @teachers = []
    @teacherusers.each do |tu|

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Teacher') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 5 )
---
  def show
    @courses = Course.find(:all)

    if !params[:from_date_cal].empty?
      @report_start_date = Time.parse(params[:from_date_cal])
    end
    if !params[:end_date_cal].empty?
      @report_end_date = Time.parse(params[:end_date_cal])
    end


    @coursedd = params[:coursedd] unless params[:coursedd][:id].empty?

    @teacherusers = Role.find_by_role_name("Teacher").users
    @teachers = []
    @teacherusers.each do |tu|

SELECT * FROM `member_courses` WHERE (course_schedule_id='59')
---
  def composemessage

    puts params[:course_schedule_radio]
    @cs_id = params[:course_schedule_radio]

    @member_courses = MemberCourse.find(:all, :conditions => ["course_schedule_id=?", @cs_id])

SELECT * FROM `course_schedules` WHERE (end_date <= '2010-04-02 07:00:00' or end_date is null AND course_id = '1' AND start_date >= '2010-04-01 07:00:00')
---
  def find_course_schedules
    CourseSchedule.find(:all, :conditions => conditions)