app/controllers/member_attendances_controller.rb

SELECT * FROM `member_attendances` WHERE (member_id = '1')
---
  def index
    if params["csid"].nil?
      @members = Member.find(:all, :conditions => ['firstname LIKE ? or lastname like ?', "#{params[:search]}%", "#{params[:search]}%"])
    else
      @tags = Tag.find(:all, :conditions => ["center_id = ?", session[:center_id]])
      @tag_names = []
      @tags.each do |tg|
        @tag_names << tg.name
      end
      @tg = @tag_names.map {|element|
        "'#{element}'"
      }.join(',');

      @member_attendances = MemberAttendance.find(:all, :conditions => ['course_schedule_id = ? and center_id=?', params[:csid], session[:center_id]])