app/controllers/member_attendances_controller.rb

  def index
    @members = Member.find(:all, :conditions => ['emailid LIKE ?', "%#{params[:search]}%"])
---
SELECT * FROM `members` WHERE (`members`.`id` = 1)

  def new


    @member_attendance = MemberAttendance.new
    @courses = Course.find(:all)

    @csidstr = params[:csid]
    unless @csidstr.blank?
      @csid  = @csidstr.to_i
      @course_schedule = CourseSchedule.find(@csid)
      @sel_course=@course_schedule.course.id
      @sel_from_date = @course_schedule.start_date
    end

    @assistantusers = Role.find_by_role_name("Volunteer").users
    @assistants = []
    @assistantusers.each do |tu|
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `course_schedules` WHERE (`course_schedules`.`id` = 17)
SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Volunteer') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 2 )

  def create

    @member_attendance = MemberAttendance.new(params[:memberattendance])
    logger.debug "******"

    logger.debug "email id " + params[:member][:email_id]
    @member_attendance.member = Member.find_by_emailid(params[:member][:email_id]) unless params[:member][:email_id].blank?
    @member_attendance.course_schedule= getOrCreateCourseSched( params[:coursesel][:id],Time.parse(params[:start_date]).to_time.utc)

    respond_to do |format|
      if @member_attendance.save
        flash[:notice] = 'Member ' + @member_attendance.member.firstname + " checked in"
---
SELECT * FROM `members` WHERE (`members`.`emailid` = 'sesani@gmail.com') LIMIT 1
INSERT INTO `course_schedules` (`start_date`, `address1`, `city`, `address2`, `created_at`, `displayname`, `country`, `updated_at`, `deleted`, `teacher_id`, `volunteer_id2`, `center_id`, `volunteer_id`, `last_updated_by`, `course_id`, `end_date`, `location_name`, `state`) VALUES('2011-05-22 07:00:00', NULL, NULL, NULL, '2011-05-22 14:54:17', NULL, NULL, '2011-05-22 14:54:17', NULL, NULL, NULL, NULL, 2, 1, 1, NULL, NULL, NULL)
INSERT INTO `member_attendances` (`course_schedule_id`, `created_at`, `member_id`, `checkin_date`, `updated_at`, `volunteer_id`) VALUES(NULL, '2011-05-22 14:46:42', 124, NULL, '2011-05-22 14:46:42', NULL)
UPDATE `members` SET `updated_at` = '2011-05-22 04:03:45' WHERE `id` = 214
SELECT * FROM `course_schedules` WHERE (start_date = '2011-05-22 07:00:00' and course_id='1') LIMIT 1