app/controllers/members_controller.rb

SELECT * FROM `members` ORDER BY firstname LIMIT 0, 10
SELECT count(*) AS count_all FROM `members`
---
  def index
    @members = Member.paginate :page => params[:page], :per_page => 10

SELECT * FROM `members` WHERE ((firstname like '%%' or lastname like '%%') and emailid like '%ajit_mahareddy@yahoo.com %')
---
  def show
    begin

      if params["search_by_name"].empty? and params["search_by_email"].empty? then
        @members = Member.find(:all).paginate :page => params[:page], :per_page => 10

SELECT * FROM `members` WHERE (`members`.`id` = 2)
---
  def edit
    @member = Member.find(params[:id])

SELECT * FROM `members` WHERE (firstname = 'venkat' AND lastname = 'test' AND emailid = 'venkat@test.com')
INSERT INTO `members` (`address1`, `city`, `created_at`, `address2`, `zip`, `country`, `updated_at`, `agetype`, `updateby`, `homephone`, `lastname`, `emailid`, `emailsubscribe`, `deleted`, `gender`, `centerid`, `firstname`, `cellphone`, `employer`, `state`, `profession`) VALUES(NULL, NULL, '2011-04-09 16:06:24', NULL, NULL, NULL, '2011-04-09 16:06:24', NULL, NULL, '408-823-1234', 'k', 'abc@gmail.com', NULL, NULL, 'M', NULL, 'abc', '408-823-2233', NULL, NULL, NULL)
---
  def create
    @member = Member.new(params[:member])
    @validatemember = Member.find(:all, :conditions => ["firstname = ? AND lastname = ? AND emailid = ?", @member.firstname, @member.lastname, @member.emailid
      ])
    if @validatemember.length == 0
      @validateemail = Member.find(:all, :conditions => ["emailid = ? ", @member.emailid])
      if @validateemail.length == 0
        @member.save

SELECT * FROM `members` WHERE (`members`.`id` = 2)
UPDATE `members` SET `gender` = 'M', `updated_at` = '2011-04-09 16:05:34', `emailid` = 'vkorimilli@gmail.com', `updateby` = 1, `homephone` = '408-823-7549', `cellphone` = '408-823-7549' WHERE `id` = 1
---
  def update
     @member = Member.find(params[:id])
      @member.updateby = current_user