app/controllers/member_course_interests_controller.rb

  def index
    @member = Member.find(params[:member_id])
    @courses = Course.find(:all)
    @selected_interests = []
      @member.member_course_interests.each do |mci|
---
SELECT * FROM `members` WHERE (`members`.`id` = 2)
SELECT * FROM `member_course_interests` WHERE (`member_course_interests`.member_id = 2)

  def new
    @courses = Course.find(:all)
    @member = Member.find(params[:member_id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 2)