app/controllers/members_controller.rb

  def index
      @session_member_id = session[:user].member.id
      @conn_ids = []
      @session_member = Member.find(@session_member_id)
---
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1

  def show
    @tags = Tag.find(:all,:conditions => ["center_id=?", session[:center_id]])
    @tag_names = []
    @tags.each do |tg|
       @tag_names << tg.name
    end
    @tg = @tag_names.map {|element|
        "'#{element}'"
      }.join(',');

        @courses = Course.find(:all)
    @courseschedules = CourseSchedule.find(:all, :conditions => ["center_id = ?", session[:center_id]], :order => "start_date desc").paginate :page => params[:page], :per_page => 10
    @cs_id = -1

    begin
      @search = Member.search(params[:search])
---
SELECT * FROM `members`