app/controllers/member_courses_controller.rb

  def index
    add_crumb("Member Courses") { |instance| instance.send :member_member_courses_path }
    @course_schedules = []
    @member = Member.find(params[:member_id])
    @member_courses = MemberCourse.find(:all, :conditions => ["member_id = ?", params[:member_id]])
    if @member_courses.length == 0
    else
      for member_course in @member_courses
        @c_s = CourseSchedule.find(:all, :conditions => ["id = ? ", member_course.course_schedule_id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 2)
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
SELECT * FROM `member_courses` WHERE (member_id = '2')
SELECT * FROM `course_schedules` WHERE (`course_schedules`.`id` = 58)

  def show
    add_crumb("Member Courses") { |instance| instance.send :member_member_courses_path }
    @course_schedules = []
    @member = Member.find(params[:member_id])
    @member_courses = MemberCourse.find(:all, :conditions => ["member_id = ?", params[:member_id]])
    if @member_courses.length == 0
    else
      for member_course in @member_courses
        @c_s = CourseSchedule.find(:all, :conditions => ["id = ? ", member_course.course_schedule_id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 69)
SELECT * FROM `member_courses` WHERE (member_id = '69')
SELECT * FROM `course_schedules` WHERE (id = 58 )

  def destroy
    add_crumb("Member Courses") { |instance| instance.send :member_member_courses_path }
    @member_course = MemberCourse.find(params[:id])
    @member_course.destroy
---
SELECT * FROM `member_courses` WHERE (`member_courses`.`id` = 96)
DELETE FROM `member_courses` WHERE `id` = 96

  def course_schedule_select
    @sel_id = params[:course][:id]

    @course = Course.find(@sel_id)
    @from_date = Date.civil(params[:range][:"from_date(1i)"].to_i,params[:range][:"from_date(2i)"].to_i,params[:range][:"from_date(3i)"].to_i)
    @to_date = Date.civil(params[:range][:"to_date(1i)"].to_i,params[:range][:"to_date(2i)"].to_i,params[:range][:"to_date(3i)"].to_i)
    @course_schedules = @course.course_schedules.find(:all, :conditions => ["start_date > ? AND start_date < ? ", @from_date, @to_date])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 2)
SELECT * FROM `course_schedules` WHERE (`course_schedules`.course_id = 2 AND (start_date > '2010-02-03' AND start_date < '2006-02-03' ))

 def course_schedule_search
   add_crumb("Attended course search")
    @courses = Course.find(:all)

    for course in @courses
      @course_schedules = CourseSchedule.find(:all, :conditions => ["course_id = ?", course.id])
---
SELECT * FROM `course_schedules` WHERE (course_id = 1)

  def course_schedule_insert
    @member_course = MemberCourse.new()
    @member_course.course_schedule_id = params[:id]
    @member_course.member_id = params[:member_id]
    @member = Member.find(params[:member_id])
    @validatecoursescheduleid = MemberCourse.find(:all, :conditions => ["course_schedule_id = ?", @member_course.course_schedule_id] )

    respond_to do |format|
    if @validatecoursescheduleid.length == 0
    @member_course.save
---
SELECT * FROM `members` WHERE (`members`.`id` = 72)
SELECT * FROM `member_courses` WHERE (course_schedule_id = 59)
INSERT INTO `member_courses` (`start_date`, `end_date`, `referral_source`, `updated_at`, `course_schedule_id`, `member_id`, `deleted`, `last_updated_by`, `created_at`) VALUES(NULL, NULL, NULL, '2010-04-04 08:30:25', 59, 72, NULL, NULL, '2010-04-04 08:30:25')