app/controllers/upload_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`role_name` = 'Teacher') LIMIT 1
SELECT * FROM `users` INNER JOIN `roles_users` ON `users`.id = `roles_users`.user_id WHERE (`roles_users`.role_id = 5 )
---
  def index
  @courses = Course.find(:all)

  @coursesel = params[:coursesel]
  @teacherssel = params[:teacherssel]
  @assistantssel1 = params[:assistantssel1]

  @teacherusers = Role.find_by_role_name("Teacher").users
    @teachers = []
    @teacherusers.each do |tu|

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
DELETE FROM `course_schedules` WHERE (`id` IN (1))
---
  def upload_file
    if params[:coursesel][:id].empty?
      flash[:notice] = 'Please select a course'
      redirect_to params.merge!(:action => :index)
    elsif params[:start_date].empty?
      flash[:notice] = 'Please choose a start date'
      redirect_to params.merge!(:action => :index)
    elsif params[:teacherssel][:id].empty?
      flash[:notice] = 'Please select a teacher'
      redirect_to params.merge!(:action => :index)
    elsif params[:assistantssel1][:id].empty?
      flash[:notice] = 'Please select an assistant'
      redirect_to params.merge!(:action => :index)
    elsif params[:upload].nil?
      flash[:notice] = 'Please select a file to upload'
      redirect_to params.merge!(:action => :index)
    else
      courseName = Course.find(params[:coursesel][:id]).name
      courseScheduleId = getOrCreateCourseSched( params[:coursesel][:id],Time.parse(params[:start_date]).to_time.utc,params[:teacherssel][:id],params[:assistantssel1][:id] )
      @mc = 0
      @mu = 0
      save(params[:upload], courseScheduleId, courseName)
      flash.now[:notice] = "File has been uploaded successfully.<br><br>Number of new members created - " + @mc.to_s + "<br>Number of existing members updated - " + @mu.to_s
    end
  rescue CustomException::WrongFileFormat
    flash[:notice] = 'The uploaded file does not belong to the Course chosen. Please verify.'
    CourseSchedule.delete(courseScheduleId)