app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      @user = User.find_by_username(@user_session.username)
      @member = Member.find_by_id(@user.member_id)
---
SELECT * FROM `users` WHERE (LOWER(`users`.username) = 'geeta') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1