app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '5') LIMIT 1
SELECT * FROM `members` WHERE (`members`.`id` = 2)
---
  def index
    if session[:current_user_super_admin]
      @users = User.find(:all,:order => 'username')
    else
      @users = User.find(:all,:order => 'username', :joins => :member, :conditions => ['members.center_id = ?', session[:center_id]]).paginate :page => params[:page], :per_page => 10

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `members` WHERE (`members`.`id` = 2)
---
  def show

    begin
      if params["search_by_username"].nil?
        if session[:current_user_super_admin]
          @users = User.find(:all,:order => 'username')
        else
          @users = User.find(:all,:order => 'username', :joins => :member, :conditions => ['members.center_id = ?', session[:center_id]]).paginate :page => params[:page], :per_page => 10

SELECT * FROM `members` WHERE (`members`.`id` = 73)
---
  def new
    @mem = Member.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def edit
    @user = User.find(params[:id])

SELECT * FROM `roles` WHERE (`roles`.`id` IN (2,3))
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
INSERT INTO `users` (`updatedate`, `updated_at`, `crypted_password`, `memberid`, `username`, `password_salt`, `updateby`, `member_id`, `persistence_token`, `deleted`, `email`, `created_at`) VALUES(NULL, '2010-04-04 17:05:47', '62412b9b63b2f007615781d7b30c31616957fe68cd373368a365606704572d425628146358e2514953df16287cb55e76de85b56aeb7e814088efc92b9d3e26c7', NULL, 'venkat', 'cJVXgIzwpd_X4E2DppF5', NULL, 73, '3364df7f49ef2cb06aeec7e14403fce1a5bab00f6031c287c247b229553687159683a815cca5e130664cbe79ee911785747dd3a42888790712e61a7b0fe66c7e', NULL, 'venkat@test.com', '2010-04-04 17:05:47')
---
  def create
    @user = User.new(params[:user])
    @user.memberid = params[:user][:member_id]
    @user.roles = Role.find(params[:role_ids]) if params[:role_ids]

    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `roles` WHERE (`roles`.`id` IN (6,7))
UPDATE `users` SET `updated_at` = '2011-04-09 16:51:09', `crypted_password` = '3465909025d09ad8f5a16fc44375f5d58dccf1c8bd6220856c40c0e3593af022137b57cf4de42f10f58a6f2f4bd78898944a5abab283b3c44f99c050a1a74c0d', `password_salt` = '-f9n-PLwg5HXrTAWF0dJ', `persistence_token` = '036acef2346b6cabb09a3925c214e34be0b43fb6c078b8a6389f7bd600b868444a3f04e3bd8f5166bb644a39abe8e9c36d63a524f65500abd1be1e6b271c13be' WHERE `id` = 2
---
  def update
    params[:user][:role_ids] ||= []
    @user = User.find(params[:id])
    # @user.roles = Role.find(params[:role_ids]) if params[:role_ids]
    @session_user = session[:user]
    if @session_user.is_super_admin
      @roles = Role.find(:all)
    else
      @roles = Role.find(:all, :conditions => ["id <> 1"])
    end
    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `members`.* FROM `members` INNER JOIN `users` ON users.member_id = members.id WHERE (firstname = '' OR lastname = '' OR emailid = 'venkat@test.com')
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
  def memberselect
    begin
     @member = Member.new(params[:member])
     if session[:current_user_super_admin]
       @members_with_users = Member.all(:conditions => ["(firstname = ? OR lastname = ? OR emailid = ?)" ,@member.firstname, @member.lastname, @member.emailid], :joins => :user)
       @members_all = Member.find(:all, :conditions => ["(firstname = ? OR lastname = ? OR emailid = ?)" ,@member.firstname, @member.lastname, @member.emailid])